Revit API Introduction Labs
Lab4_3_2_ExportSharedParamToExcel Class
 Export all target element ids and their FireRating param values to Excel.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab4_3_2_ExportSharedParamToExcel : IExternalCommand
Visual Basic (Declaration)
Public Class Lab4_3_2_ExportSharedParamToExcel _
	Implements IExternalCommand
Visual C++
public ref class Lab4_3_2_ExportSharedParamToExcel : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab4_3_2_ExportSharedParamToExcel
See Also
Lab4_3_2_ExportSharedParamToExcel Members
Labs Namespace